#include<stdio.h>
int main()
{
    int a[29],b[29],c[29];
    int i,j,k,d,e,f,ss=0,s6=0,s7=0,s8=0,s9=0;
    double ave1,ave2,ave3;
    printf("欢迎使用萌妹纸学生成绩管理程序～喵～\n请输入三科成绩时用空格将其分开，谢谢！\n如学生数量不足30人，请输入三个-1\n");
    printf("=================================================\n");
    for(i=0; i<=29; i++)
    {
        printf("请输入学号为%d的学生的三科成绩:",i+1);
        scanf("%d%d%d",&d,&e,&f);
        if(d==-1&&e==-1&&f==-1)
            break;
        else
            a[i]=d,b[i]=e,c[i]=f;
    }
    printf("=================================================\n");
    j=i,k=i;
    while(i>=0)
    {
        if(a[i]<60&&a[i]>=0)
            ss++;
        else if(a[i]<70&&a[i]>=60)
            s6++;
        else if(a[i]<80&&a[i]>=70)
            s7++;
        else if(a[i]<90&&a[i]>=80)
            s8++;
        else if(a[i]<=100&&a[i]>=90)
            s9++;
        i--;
    }
    printf("第一科目学生成绩在90分（含）以上的人数为 %d\n",s9);
    printf("第一科目学生成绩在80分（含）以上的人数为 %d\n",s8);
    printf("第一科目学生成绩在70分（含）以上的人数为 %d\n",s7);
    printf("第一科目学生成绩在60分（含）以上的人数为 %d\n",s6);
    printf("第一科目学生成绩在60分（不含）以下的人数为 %d\n",ss);
    ss=0,s6=0,s7=0,s8=0,s9=0;
    while(k>=0)
    {
        if(b[k]<60&&b[k]>=0)
            ss++;
        else if(b[k]<70&&b[k]>=60)
            s6++;
        else if(b[k]<80&&b[k]>=70)
            s7++;
        else if(b[k]<90&&b[k]>=80)
            s8++;
        else if(b[k]<=100&&b[k]>=90)
            s9++;
        k--;
    }
    printf("第二科目学生成绩在90分（含）以上的人数为 %d\n",s9);
    printf("第二科目学生成绩在80分（含）以上的人数为 %d\n",s8);
    printf("第二科目学生成绩在70分（含）以上的人数为 %d\n",s7);
    printf("第二科目学生成绩在60分（含）以上的人数为 %d\n",s6);
    printf("第二科目学生成绩在60分（不含）以下的人数为 %d\n",ss);
    ss=0,s6=0,s7=0,s8=0,s9=0;
    while(j>=0)
    {
        if(c[j]<60&&c[j]>=0)
            ss++;
        else if(c[j]<70&&c[j]>=60)
            s6++;
        else if(c[j]<80&&c[j]>=70)
            s7++;
        else if(c[j]<90&&c[j]>=80)
            s8++;
        else if(c[j]<=100&&c[j]>=90)
            s9++;
        j--;
    }
    printf("第三科目学生成绩在90分（含）以上的人数为 %d\n",s9);
    printf("第三科目学生成绩在80分（含）以上的人数为 %d\n",s8);
    printf("第三科目学生成绩在70分（含）以上的人数为 %d\n",s7);
    printf("第三科目学生成绩在60分（含）以上的人数为 %d\n",s6);
    printf("第三科目学生成绩在60分（不含）以下的人数为 %d\n",ss);
    return 0;
}
